{
  "What type of database is Neo4j?": "Graph database.",
  "Which of the following is a benefit of using a graph database over a relational database?": "To perform fast and complex traversals of highly interconnected data",
  "True or False - Neo4j supports ACID transactions.": "True",
  "True or False - It is possible to visit each landmass in the city of Königsberg while crossing each of the seven bridges only once.": "False",
  "Select all of the options that apply": ["Nodes", "Labels", "Relationships", "Properties"],
  "What statement best describes Cypher, Neo4j’s graph query language?": "It is a declarative query language designed for graph pattern matching and traversals.",
  "True or false, a relationship can start and end at the same node.": "True",
  "What statement best describes properties in Neo4j?": "Properties are the key-value pairs used for nodes and relationships.",
  "Update the following Cypher statement to find or create a node in the database.": "MERGE",
  "Which of the following statements best describes the pattern described in this MATCH clause?": "It finds nodes with the label Person with an outgoing relationship to a Movie node.",
  "In the following MATCH clause, which of the elements represents the relationship between two nodes?": "-[b]→",
  "Which of the following best describes the behavior of MERGE in Neo4j?": "It matches existing patterns or creates new ones if they do not exist.",
  "In the following Cypher statement, what do the parentheses represent?": "Nodes",
  "Which of the following Cypher statements will find people who acted in the movie Toy Story?": [
    "MATCH (p:Person)-[:ACTED_IN]→(m:Movie) WHERE m.title = 'Toy Story' RETURN p",
    "MATCH (p:Person)-[:ACTED_IN]→(m:Movie {title: 'Toy Story'}) RETURN p",
    "SELECT path= (p:Person)-[:ACTED_IN]→(m:Movie {title: 'Toy Story'}) RETURN path"
  ],
  "How can you ensure that a property exists in a Cypher query?": "Use the 'IS NOT NULL' operator",
  "How can you delete a specific node in Neo4j using Cypher?": "Use the MATCH clause to find the node and then DELETE it",
  "How can you eliminate duplicate rows in the results of a Cypher query?": "Using the DISTINCT keyword",
  "How can optional matches be useful in a Neo4j query?": "Optional matches allow you to specify patterns that may or may not exist in the graph.",
  "Given the following domain question.": ["Purchased"],
  "What are some things to look for as red flags to investigate in a Cypher query plan?": ["AllNodesScan", "NodeByLabelScan with a lot of DB hits", "Placement of eager operators"],
  "True or False - You can create an index on nodes or relationships.": "True",
  "Which of the following statements is correct?": "Neo4j allows for an optional schema",
  "How do you create a unique constraint on the email property for any node with the label User?": "CREATE CONSTRAINT FOR (u:User) REQUIRE (u.email) IS UNIQUE",
  "Which Cypher command would you use to load data from a CSV file?": "LOAD CSV",
  "In a complex data import scenario involving both nodes and relationships, which of the following sequence of steps is recommended?": "Import nodes first, then relationships",
  "What is the default port for connecting to a Neo4j database using the driver?": "7687",
  "What is the role of a driver in Neo4j?": "To establish a connection with the Neo4j database",
  "Which of the following protocols are valid to create a secure connection to Neo4j using the Driver?": ["bolt+s", "neo4j+s", "neo4j+ssc"],
  "What statement best describes index-free adjacency for a Neo4j database?": "Nodes and their relationships are stored as pointers so that access is very fast without the need for an index to traverse nodes.",
  "What protocol do the official Neo4j drivers use to access the Neo4j database?": "Bolt",
  "Which of the following Cypher statements would you use to count the number of nodes with the label Person?": ["MATCH (n:Person) RETURN count(n)"],
  "Complete the Cypher statement below to pass the p identifier to the subquery.": "WITH p",
  "In a query requiring pagination, why is it essential to use an ORDER BY clause before SKIP and LIMIT?": "It ensures consistent and predictable results across different pages.",
  "What is the difference between UNION and UNION ALL in Neo4j?": "UNION returns distinct results, while UNION ALL returns all results including duplicates",
  "Which of the following commands would you use to drop a constraint?": "DROP CONSTRAINT [constraint_name]",
  "Which Cypher clause would you use to create a subquery?": "CALL { /…/ }",
  "How do you ensure that the same relationship is not created twice between two nodes?": "Use the MERGE keyword when creating the relationship.",
  "Why would Tom Hanks appear in this Cypher statement?": "Relationships are unique within the scope of a single MATCH clause only",
  "Say you have a database with a unique constraint on the .name property for the (:Person) label.": "A Neo.ClientError.Schema.ConstraintViolation error will be thrown",
  "Which Cypher command can be used to list the indexes in a Neo4j database?": "SHOW INDEXES",
  "If you run the following Cypher statement on an empty database, which properties will exist on the node?": ["title", "released", "imdbRating"],
  "Say you open up a new database and run the following Cypher command to create a new (:Movie) node.": "Three nodes, one (:Person) and two (:Movie)",
  "Which of the following statements best describes the difference between Cypher and GraphQL?": "Cypher is a declarative graph query language designed for querying and updating data in Neo4j, while GraphQL is a query language for APIs that allows clients to specify exactly what data they need and is used for building web APIs.",
  "How can you escape special characters such as spaces in database, user and role names?": "With backticks (`).",
  "What is the difference between using EXPLAIN and PROFILE?": "EXPLAIN provides estimates, while PROFILE provides exact steps and number of rows retrieved.",
  "In Cypher, what is the primary purpose of the WITH clause?": "To divide the query into multiple parts, allowing intermediate results to be passed to the next part of the query.",
  "Complete the following Cypher statement to return the name property of the Person node.": "p.name",
  "You have a graph consisting of (:Customer) nodes with :ORDERED relationships to (:Products).": "It enables linking the order to multiple entities, such as products and shipping companies.",
  "In modeling, the use of bi-directional relationships is a good practice when:": "The semantics of the relationship in one direction is different from the other direction.",
  "You have a database consisting of (:Person) nodes connected to (:Movie) nodes through :ACTED_IN and :DIRECTED relationships?": "It provides a faster way to find a subset of (:Person) nodes",
  "How do you create a RANGE index on a relationship property?": "CREATE RANGE INDEX index_name FOR ()-[relType:RELATIONSHIP_TYPE]-() ON (relType.property_key)",
  "Which of the following Cypher statements will visualize your database schema in Workspace or Neo4j Browser?": "CALL db.schema.visualization()",
  "Complete the Cypher statement below to create an existence constraint on the rated property on the ()-[:RATED]→() relationship.": "IS NOT NULL",
  "Which of the following indexes are available in Neo4j?": ["TEXT", "RANGE", "VECTOR"],
  "What type of constraint can you use to ensure that two or more properties are unique and exist for any given label?": "Node Key Constraint",
  "Which of the following statements applies when using the LOAD CSV statement?": ["All values are cast as a string", "You must cast any values other than a string using the appropriate Cypher function"],
  "If you omit WITH HEADERS from a LOAD CSV statement, which of the following will happen?": "Each row will be treated as a list",
  "Complete the following Cypher statement to instruct Neo4j that the first row in the CSV file contains headers.": "WITH HEADERS",
  "When using a language driver, a statement of results comprises a stream of…": "records",
  "When establishing a driver connection using the neo4j+ssc, which of the following will occur?": "The driver will establish an encrypted connection but it will not verify the SSL certificate",
  "Complete the following Python code to verify the database credentials passed to the GraphDatabase.driver() method are correct.": "verify_authentication()",
  "To take advantage of the Query cache, what should you do?": ["Use parameters in your queries."],
  "Which method of traversal behavior does Neo4j use during a Cypher query?": "depth-first",
  "The following Cypher statement will match all nodes in the database and return their relationships regardless, resulting in a cartesian product. Each node will be returned as both n and m and each relationship will be returned twice.": ["Define a label for one of the nodes to narrow down the initial search area"],
  "How many records will the following Cypher statement return?": "9",
  "Suppose we want to return a list of all movies for each actor whose name contains \"Tom\". What is wrong with this code? Select the correct answer,": "You must specify WITH in the subquery for any variables you are passing to the subquery.",
  "Why is it recommended to avoid unnecessary labels in query patterns for better performance?": "Labels on non-anchor nodes force a label check, which may not be necessary.",
  "What is the recommended limit for the number of labels for a node in a data model?": "4 labels",
  "You are building a recommendation engine for an online store.": "Create a hierarchy of (:Category) nodes",
  "You receive reports from users that your website is slow. You narrow down the problem to a single Cypher statement used on the home page.": "Add an index to the :Customer.id property",
  "Before you start a query tuning exercise, you must make sure that the set of queries you will be measuring represents the correct syntax. You can use EXPLAIN to ensure that unnecessary NodeByLabelScan steps occur.": ["An index will be used as expected."],
  "Complete the Cypher statement below to query a fulltext index called movieInfo with the value in the parameter $query.": "CALL db.index.fulltext.queryNodes",
  "What makes fulltext and vector indexes different from other indexes in Neo4j?": "They must be queried by a calling a procedure.",
  "Complete the Cypher statement below to create a Vector index on the :Movie.embedding property.": "CREATE VECTOR INDEX",
  "Complete the Cypher statement below to execute the LOAD CSV command in batches of 1000 rows.": "IN TRANSACTIONS OF 1000 ROWS",
  "Complete the following Python code to execute a one-off Cypher statement and consume the results as a Pandas DataFrame.": "execute_query",
  "When using a language driver, which forms of transaction functions will be automatically retried on failure?": "Transaction functions",
  "True or False - Neo4j uses indexes to store relationships between nodes.": "False"
}